In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("raw_data.csv")
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [3]:
df2 = df.copy()

In [4]:
df2 = df2.drop_duplicates()
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [5]:
mean_age = df["age"].mean()

df2["age"] = df2["age"].fillna(mean_age)
df2

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [7]:
mean_income = df["income"].mean()

df2["income"] = df2["income"].fillna(mean_income)
df2

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female  57600.0
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA     Male  58000.0

In [8]:
df2["gender"] = df2["gender"].ffill()
df2

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female  57600.0
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA     Male  58000.0

In [9]:
df2.dropna(inplace=True)
df2

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female  57600.0
5    5        Li Wei  27.00   China     Male  51000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA     Male  58000.0

In [11]:
df2.sort_values("income", inplace=True)
df2

    id          name    age country   gender   income
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
3    3          Alex  32.75     USA  Unknown  47000.0
5    5        Li Wei  27.00   China     Male  51000.0
0    1      John Doe  29.00     USA     Male  55000.0
4    4  Maria Garcia  34.00   Spain   Female  57600.0
10  10   Emily Davis  31.00     USA     Male  58000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0

In [13]:
df2.reset_index(drop=True, inplace=True)
df2

   id          name    age country   gender   income
0   9   Carlos Ruiz  32.75  Mexico     Male  45000.0
1   3          Alex  32.75     USA  Unknown  47000.0
2   5        Li Wei  27.00   China     Male  51000.0
3   1      John Doe  29.00     USA     Male  55000.0
4   4  Maria Garcia  34.00   Spain   Female  57600.0
5  10   Emily Davis  31.00     USA     Male  58000.0
6   2    Jane Smith  32.75  Canada   Female  62000.0
7   8    Rachel Lee  29.00     USA   Female  62000.0

In [14]:
# save file

df.to_csv("sorted_data.csv")